app/Models/M_Admin.php

SELECT COUNT(*) AS `numrows`
FROM `tb_sktm`
SELECT COUNT(*) AS `numrows`
FROM `tb_spa`
SELECT COUNT(*) AS `numrows`
FROM `tb_skm`
SELECT COUNT(*) AS `numrows`
FROM `tb_spk`
SELECT COUNT(*) AS `numrows`
FROM `tb_sl`
SELECT COUNT(*) AS `numrows`
FROM `tb_pengajuan`
---
    public function count_data()
    {
        $db = \Config\Database::connect();
        $count_sktm = $db->table('tb_sktm')->countAllResults();
        $count_spa = $db->table('tb_spa')->countAllResults();
        $count_skk = $db->table('tb_skm')->countAllResults();
        $count_spk = $db->table('tb_spk')->countAllResults();
        $count_skm = $db->table('tb_skm')->countAllResults();
        $count_slainnya = $db->table('tb_sl')->countAllResults();
        // $count_skeluar = $db->table('tb_arsip_surat')->countAllResults();
        $count_spengajuan = $db->table('tb_pengajuan')->countAllResults();

SELECT *
FROM `tb_skk`
---
    public function view_data()
    {
        // $query = $this->db->table($this->tb_user)->join($this->tb_pengajuan, $this->tb_user.'.NIK = '.$this->tb_pengajuan.'.NIK')->join($this->tb_surat, $this->tb_pengajuan.'.kode_surat = '.$this->tb_surat.'.kode_surat')->get();
        $query = $this->db->table($this->tb_skk)->get();