app/Models/M_Login.php

    public function validateLogin($username, $password){
        $user = $this->db->table('tb_user')->where(['username' => $username,'password' => $password])->get()->getRowArray();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'user'
AND `password` = 'user'