app/Models/M_Skk.php

    public function view_data()
    {
        $query = $this->db->table($this->tb_skk)->get();
---
SELECT *
FROM `tb_skk`