app/Models/M_Skm.php

    public function view_data()
    {
        $query = $this->db->table($this->tb_skm)->get();
---
SELECT *
FROM `tb_skm`